texts = [
    "Поклон от Ефрема брату моему Исухии. Ты разгневался, не расспросив: меня игумен не пустил. А я отпрашивался, но он послал [меня] с Асафом к посаднику за медом. А пришли мы (двое), когда [уже] звонили. Зачем же ты гневаешься? Ведь я всегда у тебя (при тебе). А зазорно мне, что ты злое мне говорил. И [всё же] кланяюсь тебе, братец мой, хоть ты и такое говори. Ты мой, а я твой.",
    "От Станимира поклон Михалу Домажировичу. Если хочешь взять половину денег, [то я заплачу] — я поручитель перед твоим отцом за Иванка. Если же не хочешь, так я [все равно] больше дать не могу.",
    "От Доброшки к Прокше. Пришли мне гривну: Давыд-то ведь мне не дал, велит взять у вежников.",
    "От Терентия к Михалю. Пришлите коня с Яковцем — поедет Саввина дружина. Мы с Григорием в Ярославле живы-здоровы. Угличские корабли остались во льду на зиму (букв.: угличане замерзли) в Ярославле. Так что ты [посылай] до Углича, и как раз туда [едет] дружина (или: и как раз там дружина).",
    "От Микиты к Черту. Что касается того, что я [за Юрия] поручился у Петра на Городище, [в том меня] Юрий подвел: с дворянами (дворянином) не расплатился, а меня подвел… Ты сказал, что железного (пошлины)… рубль взяв. А ты с Олександра взыщи, господин (?)… возьми сапоги.",
    "Поклон от Степана Вацюте. Сколько ты взял того сукна, [в этом] я полагаюсь на Бога и на тебя. Срочно погрузи его на ладью, при этом объяви своим сукном. А сколько будет платы [за провоз], мы разочтемся [в том], сколько [будет].",
    "Поклон от Гаврилы Постни зятю моему – куму Григорию и сестре моей Улите. Поехали бы вы в город к радости моей, а нашего слова не забыли бы (не оставили бы без внимания). Дай Бог вам радость. {Ответ Григория и Улиты:} Мы все вашего слова не забудем (не забываем).",
    "От Петра к Марене. Если станет князь наделять купцов и пришлет к тебе, то ты ему скажи: «Ты, князь, [этим] ведаешь. Кого из мужей мор прошлой зимой унес, те (тех, тем) …». {Другое возможное понимание:} «Ты, князь, знаешь, сколько мужей мор прошлой зимой унес …».",
    "От Рощёны к Якиму. Купи шубу за гривну и четыре воротника из паволоки. Дай [это] Ивану Негодорожичу. А деньги получишь с ладьей.",
    "Это [грамота] от Суботки к Гюре. Вот ты продал мое дитя. А теперь веди его сюда, найдя. Если не найдешь и не приведешь ко мне, то я обращусь к князю с жалобой на тебя.",
    "От Жилы к Чудину. Дай Ондрею рубль. Если же не дашь, то сколько сраму ни заставит [Ондрей] меня принять (вариант: сколько ни заставит штрафа за бесчестье заплатить) из-за этого рубля — он твой (т. е. весь этот срам/штраф будет твой). От Жилы к Савве. Дай [такому-то] полтину …",
    "От Братяты к Нежилу. Иди, сын, домой — ты свободен. Если же не пойдешь, я пошлю за тобой судебного исполнителя. Я заплатил 20 гривен, и ты свободен.",
    "От Доброшки к Прокше. Пришли мне гривну: Давыд-то ведь мне не дал, велит взять у вежников.",
    "Меркурию воину.",
    "За три ногаты 2."
]


image_paths = ["1.png", "2.png", "3.png", "4.png", "5.png", "6.png", "7.png", 
               "8.png", "9.png", "10.png", "11.png", "12.png", "13.png", "14.png", "15.png"]